## 신한카드 사용 데이터 통계 분석
<p> 신한카드 데이터를 이용하여 지역별 관광 인사이트 도출 </p>
<p> 시각화 후 시간이 남는다면, 데이터의 마지막 날짜로부터 3개월치 취급액 예측 </p>

1.     Data Cleaning  (결측치, 이상치 처리)
2.     Feature Engineering and Variable Selection (통계 상관 분석)
3.     Model Selection and Regularization
4.     Optimization Processing
-

In [14]:
import pandas as pd # pandas를 활용하여 가공 예정.
import os #

### 1.Data Cleaning

* data를 가져와서 카운트한다.

##### 1)일단 가져온다

In [5]:
os.chdir(r"C:\Users\jhbea\python-programming\gongmo")

In [7]:
df = pd.read_csv('credit_card_data.csv',header='infer',encoding='latin1')

* 한글 encoding 해결방법 찾아야함..

In [9]:
df.shape

(3888, 26)

In [10]:
df.head(2) #꺼내본다.

,pop_cd,year,month,avg_score,avg_rat,city,sex,ages,population,num_opencard,...,monthly_installments_loan,monthly_insurance_loan,monthly_sbk_loan,loan_commitment,inst_rep_loanb,ls_rep_loanb,credit_loan,mortgage_loan,credit_card_payment,credit_card_installments_payment
0,L011,2016,1,812,2,¼­¿ï,NaN,10´ë,55000,1.44,...,0,0,0,1120000,8210000,78020000,92170000,87260000,0,0
1,L011,2016,2,773,4,¼­¿ï,NaN,10´ë,380000,1.71,...,510000,220000,1020000,680000,4660000,23300000,8260000,42410000,4000,1000

##### 2)다 들어있나 확인

In [13]:
df.info() #결측치 NA확인을 위해 정보조회

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3888 entries, 0 to 3887
Data columns (total 26 columns):
pop_cd                              3888 non-null object
year                                3888 non-null int64
month                               3888 non-null int64
avg_score                           3888 non-null int64
avg_rat                             3888 non-null int64
city                                3456 non-null object
sex                                 432 non-null object
ages                                3888 non-null object
population                          3888 non-null int64
num_opencard                        3888 non-null float64
num_usecard                         3888 non-null float64
monthly_card_spend                  3888 non-null int64
monthly_lc                          3888 non-null int64
monthly_loan                        3888 non-null int64
monthly_bk_loan                     3888 non-null int64
monthly_cd_loan                     3888 non-null int64
monthly_installments_loan           3888 non-null int64
monthly_insurance_loan              3888 non-null int64
monthly_sbk_loan                    3888 non-null int64
loan_commitment                     3888 non-null int64
inst_rep_loanb                      3888 non-null int64
ls_rep_loanb                        3888 non-null int64
credit_loan                         3888 non-null int64
mortgage_loan                       3888 non-null int64
credit_card_payment                 3888 non-null int64
credit_card_installments_payment    3888 non-null int64
dtypes: float64(2), int64(20), object(4)
memory usage: 789.8+ KB

### ->필요사항 

* 결측치 처리방법 결정 --> city, sex ---> 데이터분석방향 설정하고 무의미한거면 과감히 drop!